<?xml version="1.0" encoding="utf-8"?>
<search>
  <entry>
    <title>ART的函数运行机制</title>
    <url>/2020/06/03/ART%E7%9A%84%E5%87%BD%E6%95%B0%E8%BF%90%E8%A1%8C%E6%9C%BA%E5%88%B6/</url>
    <content><![CDATA[<h1 id="ART的函数运行机制"><a href="#ART的函数运行机制" class="headerlink" title="ART的函数运行机制"></a>ART的函数运行机制</h1><h2 id="类的加载"><a href="#类的加载" class="headerlink" title="类的加载"></a>类的加载</h2><p><code>dalvik</code> 的类加载的主要过程如下：</p>
<ol>
<li><p><code>app_process</code> 作为 <code>zygote server</code> 通过 <code>local socket</code> 处理进程创建请求，<code>zygote server</code> 是在 <code>ZygoteInit.main</code> 函数里调用 <code>ZygoteInit.runSelectLoop</code> 监听。</p>
</li>
<li><p>接收到 <code>zygote client</code> 的 <code>fork</code> 请求之后，调用 <code>ZygoteConnection.runOnce</code> ，调用 <code>Zygote.forkAndSpecialize</code> 创建新进程</p>
</li>
<li><p>进程创建之后，由 <code>ZygoteConnection.handleParentProc</code> 来初始化进程，最终会调用 <code>ActivityThread.main</code> 函数</p>
</li>
<li><p><code>ActivityThread.main -&gt; ActivityThread.attach -&gt;  ActivityThread.bindApplication -&gt; Activity.handleBindApplication，handleBindApplication</code> 会初始化 <code>BaseDexClassLoader</code> 。</p>
</li>
<li><p>类的加载经过了 <code>ClassLoader.loadClass-&gt;BaseDexClassLoader.findClass-&gt;DexPathList.findClass-&gt;DexFile.loadClassBinaryName-&gt;DexFile.defineClassNative-&gt;DexFile_defineClassNative</code> (<code>runtime/native/dalvik_system_DexFile.cc</code>) 。</p>
</li>
</ol>

<figure class="highlight cpp"><table><tr><td class="code"><pre><span class="line"><span class="comment">// main.cpp</span></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span></span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">protected</span>:</span><br><span class="line">    <span class="type">int</span> n;</span><br><span class="line"></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="type">int</span> <span class="title">foo</span><span class="params">(<span class="type">int</span> p)</span></span></span><br><span class="line"><span class="function">    </span>&#123;</span><br><span class="line">        <span class="keyword">return</span> n + p;</span><br><span class="line">    &#125;</span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">int</span> <span class="title">bar</span><span class="params">(<span class="type">int</span> p)</span></span>&#123;</span><br><span class="line">        <span class="keyword">return</span> n + p;</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Point</span></span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">double</span> cx, cy;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived</span> : <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="type">int</span> <span class="title">foo</span><span class="params">(<span class="type">int</span> p)</span></span></span><br><span class="line"><span class="function">    </span>&#123;</span><br><span class="line">        <span class="keyword">return</span> n + a + p;</span><br><span class="line">    &#125;</span><br><span class="line"></span><br><span class="line"><span class="keyword">protected</span>:</span><br><span class="line">    <span class="type">int</span> a, b;</span><br><span class="line">    Point a_point;</span><br><span class="line">    <span class="type">char</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">(<span class="type">int</span> argc, <span class="type">char</span> **argv)</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line">    <span class="keyword">return</span> <span class="built_in">sizeof</span>(Derived);</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<h1 id="msvc"><a href="#msvc" class="headerlink" title="msvc"></a>msvc</h1><p>命令格式：</p>
<ul>
<li>查看单个类的内存布局： <code>cl &lt;FileName&gt; /d1reportSingleClassLayout[ClassName]</code> 。</li>
<li>查看所有类的内存布局： <code>cl &lt;FileName&gt; /d1reportAllClassLayout</code> 。</li>
</ul>
<p>使用 cl 查看单个类的内存布局：</p>
<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line">cl main.cpp /d1reportSingleClassLayoutDerived &gt; msvc.txt</span><br></pre></td></tr></table></figure>

<p>输出内容：</p>
<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line">main.cpp</span><br><span class="line"></span><br><span class="line">class Derived	size(40):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | n</span><br><span class="line">	| +---</span><br><span class="line"> 8	| a</span><br><span class="line">12	| b</span><br><span class="line">16	| Point a_point</span><br><span class="line">32	| c</span><br><span class="line">  	| &lt;alignment member&gt; (size=7)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Derived::<span class="variable">$vftable</span>@:</span><br><span class="line">	| &amp;Derived_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base::bar</span><br><span class="line">Microsoft (R) Incremental Linker Version 14.29.30151.0</span><br><span class="line">Copyright (C) Microsoft Corporation.  All rights reserved.</span><br><span class="line"></span><br><span class="line">/out:main.exe</span><br><span class="line">main.obj</span><br></pre></td></tr></table></figure>


<p>参考：<a href="https://www.gonwan.com/2010/09/20/c-class-layout-using-msvc/">https://www.gonwan.com/2010/09/20/c-class-layout-using-msvc/</a></p>
<h1 id="gcc"><a href="#gcc" class="headerlink" title="gcc"></a>gcc</h1><p>命令格式：</p>
<ul>
<li>gcc8 之前：<code>gcc -fdump-class-hierarchy &lt;FileName&gt;</code>。</li>
<li>gcc8 之后：<code>gcc -fdump-lang-class &lt;FileName&gt;</code>。</li>
</ul>
<p>使用例子：</p>
<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line">gcc -fdump-lang-class main.cpp</span><br></pre></td></tr></table></figure>

<p>输出的内容:</p>
<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line">Vtable <span class="keyword">for</span> Base</span><br><span class="line">Base::_ZTV4Base: 3 entries</span><br><span class="line">0     (int (*)(...))0</span><br><span class="line">8     (int (*)(...))(&amp; _ZTI4Base)</span><br><span class="line">16    (int (*)(...))Base::bar</span><br><span class="line"></span><br><span class="line">Class Base</span><br><span class="line">   size=16 align=8</span><br><span class="line">   base size=12 base align=8</span><br><span class="line">Base (0x0x7fcb184c8420) 0</span><br><span class="line">    vptr=((&amp; Base::_ZTV4Base) + <span class="number">16</span>)</span><br><span class="line"></span><br><span class="line">Class Point</span><br><span class="line">   size=<span class="number">16</span> align=<span class="number">8</span></span><br><span class="line">   base size=<span class="number">16</span> base align=<span class="number">8</span></span><br><span class="line">Point (<span class="number">0</span>x0x7fcb184c8540) <span class="number">0</span></span><br><span class="line"></span><br><span class="line">Vtable for Derived</span><br><span class="line">Derived::_ZTV7Derived: <span class="number">3</span> entries</span><br><span class="line"><span class="number">0</span>     (int (*)(...))0</span><br><span class="line">8     (int (*)(...))(&amp; _ZTI7Derived)</span><br><span class="line">16    (int (*)(...))Base::bar</span><br><span class="line"></span><br><span class="line">Class Derived</span><br><span class="line">   size=48 align=8</span><br><span class="line">   base size=41 base align=8</span><br><span class="line">Derived (0x0x7fcb18374208) 0</span><br><span class="line">    vptr=((&amp; Derived::_ZTV7Derived) + <span class="number">16</span>)</span><br><span class="line">  Base (<span class="number">0</span>x0x7fcb184c85a0) <span class="number">0</span></span><br><span class="line">      primary-for Derived (<span class="number">0</span>x0x7fcb18374208)</span><br></pre></td></tr></table></figure>



<p>参考：</p>
<p><a href="https://stackoverflow.com/questions/2979606/print-layout-of-c-object-with-g-compiler">https://stackoverflow.com/questions/2979606/print-layout-of-c-object-with-g-compiler</a></p>
<p><a href="https://gcc.gnu.org/onlinedocs/gcc-13.2.0/gcc/Developer-Options.html">https://gcc.gnu.org/onlinedocs/gcc-13.2.0/gcc/Developer-Options.html</a></p>
<h1 id="clang"><a href="#clang" class="headerlink" title="clang"></a>clang</h1><p>命令格式：<code>clang -cc1 -fdump-record-layouts &lt;FileName&gt;</code></p>
<p>使用例子:</p>
<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line">clang -cc1 -fdump-record-layouts main.cpp &gt; clang.txt</span><br></pre></td></tr></table></figure>

<p>输出内容：</p>
<figure class="highlight bash"><table><tr><td class="code"><pre><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Base</span><br><span class="line">         0 |   (Base vtable pointer)</span><br><span class="line">         8 |   int n</span><br><span class="line">           | [sizeof=16, dsize=12, align=8,</span><br><span class="line">           |  nvsize=12, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | struct Point</span><br><span class="line">         0 |   double cx</span><br><span class="line">         8 |   double cy</span><br><span class="line">           | [sizeof=16, dsize=16, align=8,</span><br><span class="line">           |  nvsize=16, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived</span><br><span class="line">         0 |   class Base (primary base)</span><br><span class="line">         0 |     (Base vtable pointer)</span><br><span class="line">         8 |     int n</span><br><span class="line">        12 |   int a</span><br><span class="line">        16 |   int b</span><br><span class="line">        24 |   struct Point a_point</span><br><span class="line">        24 |     double cx</span><br><span class="line">        32 |     double cy</span><br><span class="line">        40 |   char c</span><br><span class="line">           | [sizeof=48, dsize=41, align=8,</span><br><span class="line">           |  nvsize=41, nvalign=8]</span><br><span class="line"></span><br></pre></td></tr></table></figure>

<p>参考：<br><a href="https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/">https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/</a></p>
]]></content>
      <categories>
        <category>C++</category>
      </categories>
      <tags>
        <tag>C++</tag>
      </tags>
  </entry>
  <entry>
    <title>堆溢出利用</title>
    <url>/2022/05/10/%E5%A0%86%E6%BA%A2%E5%87%BA%E5%88%A9%E7%94%A8/</url>
    <content><![CDATA[<h1 id="堆的数据结构和管理策略"><a href="#堆的数据结构和管理策略" class="headerlink" title="堆的数据结构和管理策略"></a>堆的数据结构和管理策略</h1><h2 id="空表"><a href="#空表" class="headerlink" title="空表"></a>空表</h2><p>空闲堆块的块首中包含一对重要的指针，这对指针用于将空闲堆块组织成双向链表。按照堆块的大小不同，空表总共被分为 128条。</p>
<h2 id="块表"><a href="#块表" class="headerlink" title="块表"></a>块表</h2>]]></content>
      <categories>
