<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width">
<meta name="theme-color" content="#222" media="(prefers-color-scheme: light)">
<meta name="theme-color" content="#222" media="(prefers-color-scheme: dark)"><meta name="generator" content="Hexo 6.3.0">

  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/images/logo.svg" color="#222">

<link rel="stylesheet" href="/css/main.css">



<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.2.1/css/all.min.css" integrity="sha256-Z1K5uhUaJXA7Ll0XrZ/0JhX4lAtZFpT6jkKrEDT0drU=" crossorigin="anonymous">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/animate.css/3.1.1/animate.min.css" integrity="sha256-PR7ttpcvz8qrF57fur/yAx1qXMFJeJFiA6pSzWi0OIE=" crossorigin="anonymous">


<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">// main.cpp</span></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span></span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">protected</span>:</span><br><span class="line">    <span class="type">int</span> n;</span><br><span class="line"></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="type">int</span> <span class="title">foo</span><span class="params">(<span class="type">int</span> p)</span></span></span><br><span class="line"><span class="function">    </span>&#123;</span><br><span class="line">        <span class="keyword">return</span> n + p;</span><br><span class="line">    &#125;</span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">int</span> <span class="title">bar</span><span class="params">(<span class="type">int</span> p)</span></span>&#123;</span><br><span class="line">        <span class="keyword">return</span> n + p;</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Point</span></span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">double</span> cx, cy;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived</span> : <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="type">int</span> <span class="title">foo</span><span class="params">(<span class="type">int</span> p)</span></span></span><br><span class="line"><span class="function">    </span>&#123;</span><br><span class="line">        <span class="keyword">return</span> n + a + p;</span><br><span class="line">    &#125;</span><br><span class="line"></span><br><span class="line"><span class="keyword">protected</span>:</span><br><span class="line">    <span class="type">int</span> a, b;</span><br><span class="line">    Point a_point;</span><br><span class="line">    <span class="type">char</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">(<span class="type">int</span> argc, <span class="type">char</span> **argv)</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line">    <span class="keyword">return</span> <span class="built_in">sizeof</span>(Derived);</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<h1 id="msvc"><a href="#msvc" class="headerlink" title="msvc"></a>msvc</h1><p>命令格式：</p>
<ul>
<li>查看单个类的内存布局： <code>cl &lt;FileName&gt; /d1reportSingleClassLayout[ClassName]</code> 。</li>
<li>查看所有类的内存布局： <code>cl &lt;FileName&gt; /d1reportAllClassLayout</code> 。</li>
</ul>
<p>使用 cl 查看单个类的内存布局：</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cl main.cpp /d1reportSingleClassLayoutDerived &gt; msvc.txt</span><br></pre></td></tr></table></figure>

<p>输出内容：</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br></pre></td><td class="code"><pre><span class="line">main.cpp</span><br><span class="line"></span><br><span class="line">class Derived	size(40):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | n</span><br><span class="line">	| +---</span><br><span class="line"> 8	| a</span><br><span class="line">12	| b</span><br><span class="line">16	| Point a_point</span><br><span class="line">32	| c</span><br><span class="line">  	| &lt;alignment member&gt; (size=7)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Derived::<span class="variable">$vftable</span>@:</span><br><span class="line">	| &amp;Derived_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base::bar</span><br><span class="line">Microsoft (R) Incremental Linker Version 14.29.30151.0</span><br><span class="line">Copyright (C) Microsoft Corporation.  All rights reserved.</span><br><span class="line"></span><br><span class="line">/out:main.exe</span><br><span class="line">main.obj</span><br></pre></td></tr></table></figure>


<p>参考：<a target="_blank" rel="noopener" href="https://www.gonwan.com/2010/09/20/c-class-layout-using-msvc/">https://www.gonwan.com/2010/09/20/c-class-layout-using-msvc/</a></p>
<h1 id="gcc"><a href="#gcc" class="headerlink" title="gcc"></a>gcc</h1><p>命令格式：</p>
<ul>
<li>gcc8 之前：<code>gcc -fdump-class-hierarchy &lt;FileName&gt;</code>。</li>
<li>gcc8 之后：<code>gcc -fdump-lang-class &lt;FileName&gt;</code>。</li>
</ul>
<p>使用例子：</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">gcc -fdump-lang-class main.cpp</span><br></pre></td></tr></table></figure>

<p>输出的内容:</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br></pre></td><td class="code"><pre><span class="line">Vtable <span class="keyword">for</span> Base</span><br><span class="line">Base::_ZTV4Base: 3 entries</span><br><span class="line">0     (int (*)(...))0</span><br><span class="line">8     (int (*)(...))(&amp; _ZTI4Base)</span><br><span class="line">16    (int (*)(...))Base::bar</span><br><span class="line"></span><br><span class="line">Class Base</span><br><span class="line">   size=16 align=8</span><br><span class="line">   base size=12 base align=8</span><br><span class="line">Base (0x0x7fcb184c8420) 0</span><br><span class="line">    vptr=((&amp; Base::_ZTV4Base) + <span class="number">16</span>)</span><br><span class="line"></span><br><span class="line">Class Point</span><br><span class="line">   size=<span class="number">16</span> align=<span class="number">8</span></span><br><span class="line">   base size=<span class="number">16</span> base align=<span class="number">8</span></span><br><span class="line">Point (<span class="number">0</span>x0x7fcb184c8540) <span class="number">0</span></span><br><span class="line"></span><br><span class="line">Vtable for Derived</span><br><span class="line">Derived::_ZTV7Derived: <span class="number">3</span> entries</span><br><span class="line"><span class="number">0</span>     (int (*)(...))0</span><br><span class="line">8     (int (*)(...))(&amp; _ZTI7Derived)</span><br><span class="line">16    (int (*)(...))Base::bar</span><br><span class="line"></span><br><span class="line">Class Derived</span><br><span class="line">   size=48 align=8</span><br><span class="line">   base size=41 base align=8</span><br><span class="line">Derived (0x0x7fcb18374208) 0</span><br><span class="line">    vptr=((&amp; Derived::_ZTV7Derived) + <span class="number">16</span>)</span><br><span class="line">  Base (<span class="number">0</span>x0x7fcb184c85a0) <span class="number">0</span></span><br><span class="line">      primary-for Derived (<span class="number">0</span>x0x7fcb18374208)</span><br></pre></td></tr></table></figure>



<p>参考：</p>
<p><a target="_blank" rel="noopener" href="https://stackoverflow.com/questions/2979606/print-layout-of-c-object-with-g-compiler">https://stackoverflow.com/questions/2979606/print-layout-of-c-object-with-g-compiler</a></p>
<p><a target="_blank" rel="noopener" href="https://gcc.gnu.org/onlinedocs/gcc-13.2.0/gcc/Developer-Options.html">https://gcc.gnu.org/onlinedocs/gcc-13.2.0/gcc/Developer-Options.html</a></p>
<h1 id="clang"><a href="#clang" class="headerlink" title="clang"></a>clang</h1><p>命令格式：<code>clang -cc1 -fdump-record-layouts &lt;FileName&gt;</code></p>
<p>使用例子:</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">clang -cc1 -fdump-record-layouts main.cpp &gt; clang.txt</span><br></pre></td></tr></table></figure>

<p>输出内容：</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Base</span><br><span class="line">         0 |   (Base vtable pointer)</span><br><span class="line">         8 |   int n</span><br><span class="line">           | [sizeof=16, dsize=12, align=8,</span><br><span class="line">           |  nvsize=12, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | struct Point</span><br><span class="line">         0 |   double cx</span><br><span class="line">         8 |   double cy</span><br><span class="line">           | [sizeof=16, dsize=16, align=8,</span><br><span class="line">           |  nvsize=16, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping AST Record Layout</span><br><span class="line">         0 | class Derived</span><br><span class="line">         0 |   class Base (primary base)</span><br><span class="line">         0 |     (Base vtable pointer)</span><br><span class="line">         8 |     int n</span><br><span class="line">        12 |   int a</span><br><span class="line">        16 |   int b</span><br><span class="line">        24 |   struct Point a_point</span><br><span class="line">        24 |     double cx</span><br><span class="line">        32 |     double cy</span><br><span class="line">        40 |   char c</span><br><span class="line">           | [sizeof=48, dsize=41, align=8,</span><br><span class="line">           |  nvsize=41, nvalign=8]</span><br><span class="line"></span><br></pre></td></tr></table></figure>

<p>参考：<br><a target="_blank" rel="noopener" href="https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/">https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/</a></p>

    </div>

    
    
    

    <footer class="post-footer">
          <div class="post-tags">
              <a href="/tags/C/" rel="tag"># C++</a>
          </div>

        

          <div class="post-nav">
            <div class="post-nav-item">
                <a href="/2023/07/04/ARMv8%E5%AD%A6%E4%B9%A0%E8%AE%B0%E5%BD%9512/" rel="prev" title="ARMv8学习记录12">
                  <i class="fa fa-chevron-left"></i> ARMv8学习记录12
                </a>
            </div>
            <div class="post-nav-item">
